Autodesk.Revit.DB.Sketch.GetAllElements
Returns all elements which belong to the sketch.
Remarks:
Following elements can belong to a sketch:
Autodesk.Revit.DB.ModelCurve,
Autodesk.Revit.DB.ReferencePlane,
Autodesk.Revit.DB.Dimension.
To get matching between Autodesk.Revit.DB.Curve from Autodesk.Revit.DB.Sketch.Profile and Autodesk.Revit.DB.ModelCurve, use Autodesk::Revit::DB::Curve::Reference::ElementId.
Returns:
Returns ids of elements which belong to that sketch.
Since:
2022

Autodesk.Revit.DB.Sketch.OwnerId
Returns id of the sketch owner element or invalidElementId if sketch does not build a geometry.
Since:
2022

Autodesk.Revit.DB.Sketch.SketchPlane
Returns the Sketch Plane of the Sketch.
Remarks:
This property is used to retrieve the Sketch Plane of Sketch.